Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: If that item is relocated in the data set, the ID returned for that item should be the same.
zh_cn: 如果在数据集中重新定位了该项，则为该项返回的 ID 应相同。

source: If the EditText child is not a TextInputEditText, make sure to set the EditText's android:background to null when using an outlined or filled text field.
zh_cn: 如果 EditText 子项不是 TextInputEditText，请确保设置 EditText 的 android:background 为 null。

source: If the IntDef#flag() attribute is set to true, multiple constants can be combined.
zh_cn: 如果 IntDef#flag() 属性设置为 true ，则可以组合多个常量。

source: If the LayoutManager specifies a default constructor or one with the signature (Context, AttributeSet, int, int), RecyclerView will instantiate and set the LayoutManager when being inflated.
zh_cn: 如果 LayoutManager 指定了默认的或是签名为 (Context, AttributeSet, int, int)的构造方法，RecyclerView 将在被加载时初始化并设置 LayoutManager。

source: If the Toolbar has an expanded action view it can be collapsed using the collapseActionView() method.
zh_cn: 如果工具栏具有展开的操作 view，则可以使用 collapseActionView() 方法折叠它。

source: If the View is marked as ignored, it should first call LayoutManager#stopIgnoringView(View) before returning the View.
zh_cn: 如果 view 被标记为已忽略，则在返回 view 之前，它应首先调用 LayoutManager#stopIgnoringView(View)。

source: If the View is scrapped, it will be removed from scrap list.
zh_cn: 如果 view 是 scrapped，它将从 scrap 列表中移除。

source: If the adapter previously freed any resources in #onViewDetachedFromWindow(RecyclerView.ViewHolder) onViewDetachedFromWindow those resources should be restored here.
zh_cn: 如果适配器以前在 #onViewDetachedFromWindow(RecyclerView.ViewHolder) onViewDetachedFromWindow 中释放了任何资源，则应在此处还原这些资源。

source: If the animation is attached to a view that has children, the animation will affect the entire subtree rooted by that node.
zh_cn: 如果动画附加到一个有子 view 的 view，动画将会影响该 view 节点下的整个 view 树。

source: If the annotated element is a class, then all methods in the class should be called on a worker thread.
zh_cn: 如果注解的元素是一个类，则类中的所有方法都应该只在工作线程被调用。

source: If the annotated element is a class, then all methods in the class should be called on the UI thread.
zh_cn: 如果注解的元素是一个类，则类中的所有方法都应该只在 UI 线程被调用。

source: If the annotated element is a class, then all methods in the class should be called on the binder thread.
zh_cn: 如果注解的元素是一个类，则类中的所有方法都应该只在绑定线程被调用。

source: If the annotated element is a class, then all methods in the class should be called on the main thread.
zh_cn: 如果注解的元素是一个类，则类中的所有方法都应该只在主线程被调用。

source: If the base configuration changes (such as due to an orientation change), the resources of this context will also change except for those that have been explicitly overridden with a value here.
zh_cn: 如果基本配置发生更改(例如由于方向更改)，则此上下文的资源也将更改，除非已在此处显式覆盖了值。

source: If the child is a TableRow, then the height is always ViewGroup.LayoutParams.WRAP_CONTENT.
zh_cn: 如果子项是 TableRow，则身高始终为 ViewGroup.LayoutParams.WRAP_CONTENT。

source: If the child is the start of a horizontal chain, this attribute will drive how the elements of the chain will be positioned.
zh_cn: 如果该 child 是水平链的开头，该属性将驱动链的元素如何定位。

source: If the child is the start of a vertical chain, this attribute will drive how the elements of the chain will be positioned.
zh_cn: 如果 child 是垂直链的开头，该属性将会驱动链的元素的如何定位。

source: If the code comments have little boxes of stars around them, make your comments have little boxes of stars around them too.
zh_cn: 如果代码备注的周围是用星号组成的小方框，你也应该将备注放在这样的小方框内。

source: If the code you add to a file looks drastically different from the existing code around it, it throws readers out of their rhythm when they go to read it.
zh_cn: 如果你添加到文件的代码看起来与其周围的现有代码明显不同，那么当读者读到此处时，这些代码会打乱他们的节奏。

source: If the content of the dragged child view is itself horizontally scrollable, the user may grab it by the very edge.
zh_cn: 如果拖动的子 view 的内容本身是水平可滚动的，则用户可以在最边缘抓取它。

source: If the content view exist on the screen it is treated as gone from its original location.
zh_cn: 如果屏幕上存在内容 view，则将其视为从其原始位置消失。

source: If the contents don't fit in this region, then the image will be stretched so that they do.
zh_cn: 如果内容不适应该区域，图片将会被拉伸以便适应。

source: If the current point is not equal to the first point of the contour, a line segment is automatically added.
zh_cn: 如果当前点不等于轮廓的第一个点，则自动添加线段。

source: If the current theme is derived from R.style.Theme the widget presents the current value as an editable input field with an increment button above and a decrement button below.
zh_cn: 如果当前主题派生自 R.style.Theme，则小部件将当前值显示为可编辑的输入域，上面有一个增量按钮，下面是一个减量按钮。

source: If the current theme is derived from R.style.Theme_Holo or R.style.Theme_Holo_Light the widget presents the current value as an editable input field with a lesser value above and a greater value below.
zh_cn: 如果当前主题派生自 R.style.Theme_Holo 或 R.style.Theme_Holo_Light 小部件呈现当前值作为可编辑输入域，其上方有小于值，且下方有大于值。

source: If the current theme is derived from R.style.Theme_Material the widget presents the current value as a scrolling vertical selector with the selected value in the center and the previous and following numbers above and below, separated by a divider.
zh_cn: 如果当前主题派生自 R.style.Theme_Material，则小部件将当前值显示为滚动的垂直选择器，其中选中的值位于中心，前面和后面的数字位于上方和下方，由分隔线分隔。

source: If the decode operation cannot use this bitmap, the decode method will return null and will throw an IllegalArgumentException.
zh_cn: 如果解码操作无法使用此位图，则解码方法将返回 null，并将引发 IllegalArgumentException。

source: If the default background is changed, MaterialButton cannot guarantee well-defined behavior.
zh_cn: 如果更改了默认背景，MaterialButton 无法保证定义明确的行为。

source: If the device has touch capabilities, however, and the user begins interacting with the interface by touching it, it is no longer necessary to always highlight, or give focus to, a particular view.
zh_cn: 然而，如果设备有触摸能力，当用户用解摸来进行交互时，将不必给特定的 view 进行高亮或给予焦点。

source: If the encoded image is an animated GIF or WEBP, decodeDrawable will return an AnimatedImageDrawable.
zh_cn: 如果编码图像是动画 GIF 或 WEBP，decodeDrawable 将返回 AnimatedImageDrawable。

source: If the encoded image is incomplete or contains an error, or if an Exception occurs during decoding, a DecodeException will be thrown.
zh_cn: 如果编码图像不完整或包含错误，或者在解码期间发生 Exception，则 DecodeException 将被抛出。

source: If the encoded source does not exactly match any Bitmap.Config, the next highest quality Bitmap.Config will be used avoiding any loss in image quality.
zh_cn: 如果编码的源与任何 Bitmap.Config 不完全匹配，则下一个最高质量的 Bitmap.Config 将使用以避免图像质量的任何损失。

source: If the error is SOURCE_EXCEPTION, the underlying Throwable can be retrieved with Throwable.getCause().
zh_cn: 如果错误是 SOURCE_EXCEPTION，则可以使用 Throwable.getCause() 检索底层的 Throwable 。

source: If the event is targeting accessibility focus we give it to the view that has accessibility focus and if it does not handle it we clear the flag and dispatch the event to all children as usual.
zh_cn: 如果事件的目标是无障碍焦点，我们将其提供给具有无障碍焦点的 view，如果它未处理它，我们将清除标志并像往常一样将事件分派给所有子级。

source: If the event should be handled by accessibility focus first.
zh_cn: 是否应首先由辅助功能焦点处理事件。

source: If the event targets the accessibility focused view and this is it, start
zh_cn: 如果事件目标的可达集中 view，这是它的开始

source: If the event targets the accessibility focused view and this is it, start normal event dispatch.
zh_cn: 如果事件目标是无障碍聚焦的 view，并且这就是它，开始正常事件分发。

source: If the listener determines there should not be a refresh, it must call setRefreshing(false) to cancel any visual indication of a refresh.
zh_cn: 如果监听器确定不应该刷新，则必须调用 setRefreshing(false) 来取消刷新的任何可视指示。

source: If the match was successful but the group specified failed to match any part of the input sequence, then null is returned.
zh_cn: 如果该匹配成功了，但指定组未能匹配输入序列的任何部分，则返回 null。

source: If the method does something more complex (such as enforcing a constraint or has an important side effect), then you must document it.
zh_cn: 如果该方法执行更复杂的操作(例如强制实施约束条件或具有重大副作用)，那么你必须添加备注。

source: If the padding lines are not included, Android uses the left and top lines to define this drawable area.
zh_cn: 如果没有设置 padding 线，安卓使用左边和上边的线来定义绘制区域。

source: If the payload is empty, Adapter must run a full bind.
zh_cn: 如果 payload 为空，则适配器必须运行完全绑定。

source: If the payloads list is not empty, the ViewHolder is currently bound to old data and Adapter may run an efficient partial update using the payload info.
zh_cn: 如果 payloads 列表不为空，则 ViewHolder 当前绑定到旧数据，适配器可以使用 payloads 信息运行有效的部分更新。

source: If the post failed, unpress right now
zh_cn: 如果 post 失败了，立即 unpress

source: If the post-layout transform properties are used to draw a sibling view on top of the SurfaceView, the view may not be properly composited with the surface.
zh_cn: 如果使用布局后变换属性在 SurfaceView 顶部绘制同级 view，则 view 可能无法与 surface 正确合成。

source: If the radio button is already checked, this method will not toggle the radio button.
zh_cn: 如果已选中单选按钮，则此方法不会切换单选按钮。

source: If the returned array is of non-zero length then the first element of the array represents the top of the stack, which is the most recent method invocation in the sequence.
zh_cn: 如果返回的数组非零长度，则数组的第一个元素表示堆栈的顶部，这是序列中最近的方法调用。

source: If the rotationX or rotationY properties are changed and this view is large (more than half the size of the screen), it is recommended to always use a camera distance that's greater than the height (X axis rotation) or the width (Y axis rotation) of this view.
zh_cn: 如果更改了 rotationX 或 rotationY 属性并且此 view 很大（超过屏幕大小的一半），建议始终使用大于 view 高度（X 轴旋转​​）或宽度（Y 轴旋转）的相机距离。

source: If the specific type is known, use one of the more specific annotations instead, such as StringRes or DrawableRes.
zh_cn: 如果已知特定的类型，使用一个更具体的注解代替，如 StringRes 或 DrawableRes。

source: If the specified file name is null, or cannot be decoded into a bitmap, the function returns null.
zh_cn: 如果指定的文件名为空，或者无法解码为位图，则函数返回 null。

source: If the string cannot be parsed, throws an IllegalArgumentException exception.
zh_cn: 如果无法解析字符串，则抛出 IllegalArgumentException 异常。

source: If the tool shows that these methods are taking a long time to finish executing, you should explore further to see what work is occurring there.
zh_cn: 如果该工具显示这些方法需要很长时间才能完成执行，那么你应该进一步探索以查看正在进行的工作。

source: If the value must be used outside of the try block, then it must be declared before the try block, where it cannot yet be sensibly initialized:
zh_cn: 如果该值必须在 try 块之外使用，那么你必须在 try 块之前对其进行声明，因为它在 try 块中尚无法合理地初始化：

source: If the value you want to change is one of the base View properties, doing the animation is even easier, because Views have a built-in ViewPropertyAnimator that is optimized for simultaneous animation of multiple properties.
zh_cn: 如果要更改的值是基本 View 属性之一，则执行动画会更加容易，因为 view 具有内置的 ViewPropertyAnimator，针对多个属性的同步动画进行了优化。

source: If the values are not monotonic, the drawing may produce unexpected results.
zh_cn: 如果这些值不是单调的，则绘图可能会产生意想不到的结果。

source: If there are multiple annotations, or parameterized annotations, they should each be listed one-per-line in alphabetical order.
zh_cn: 如果有多个注释或参数化注释，则应各占一行并按字母顺序排列。

source: If there is a changed scrap, try to find from there
zh_cn: 如果有更改的废料，试图从里面查找

source: If there is a component that is already very similar to what you want, you can simply extend that component and just override the behavior that you want to change.
zh_cn: 如果有一个组件已经非常接近你想要的组件，你可以简单的继承那个组件并且重写你想要改变的行为。

source: If there is a security manager, and this thread is not the current thread, then the security manager's checkPermission method is called with a RuntimePermission("getStackTrace") permission to see if it's ok to get the stack trace.
zh_cn: 如果有安全管理器，并且此线程不是当前线程，则会调用安全管理器的 checkPermission 方法(带 RuntimePermission("getStackTrace") 的权限作为参数)来查看是否可以获取堆栈跟踪。

source: If there is a view that has accessibility focus we want it to get the event first and if not handled we will perform a normal dispatch.
zh_cn: 如果有一个具有无障碍焦点的 view，我们希望它首先获取事件，如果它未处理，我们将执行正常的分派。

source: If there is no capturing group in the pattern with the given index
zh_cn: 如果在给定索引的模式中不存在捕获组

source: If they have constraints to other widgets they will still be respected, but any margins will be as if equals to zero
zh_cn: 如果他们对其他小部件有约束力，那么他们仍然会受到尊重，但任何 margin 都将等于零（译注：GONE 的小部件 margin 不生效。）

source: If this Fragment is a child of another Fragment, the FragmentManager returned here will be the parent's getChildFragmentManager().
zh_cn: 如果该 Fragment 是另一个 Fragment 的 child，此处返回的 FragmentManager 应该是 parent 的 getChildFragmentManager().

source: If this ItemDecoration does not affect the positioning of item views, it should set all four fields of outRect (left, top, right, bottom) to zero before returning.
zh_cn: 如果该 ItemDecoration 不影响 item views 的位置，在返回前应该把 outRect 的四个字段都设为 0(left, top, right, bottom)。

source: If this Toolbar does not have an expanded action view this method has no effect.
zh_cn: 如果此工具栏没有展开的操作 view，则此方法无效。

source: If this flag is not set, SYSTEM_UI_FLAG_HIDE_NAVIGATION will be force cleared by the system on any user interaction.
zh_cn: 如果未设置此标志，系统将在任何用户交互时强制清除 SYSTEM_UI_FLAG_HIDE_NAVIGATION。

source: If this flag is not set, SYSTEM_UI_FLAG_HIDE_NAVIGATION will be force cleared by the system on any user interaction, and SYSTEM_UI_FLAG_FULLSCREEN will be force-cleared by the system if the user swipes from the top of the screen.
zh_cn: 如果未设置此标志，系统将在任何用户交互时强制清除 SYSTEM_UI_FLAG_HIDE_NAVIGATION，并且如果用户从屏幕顶部滑动，系统将强制清除 SYSTEM_UI_FLAG_FULLSCREEN。

source: If this is 0, decodeResource(Resources, int), decodeResource(Resources, int, android.graphics.BitmapFactory.Options), and decodeResourceStream(Resources, TypedValue, InputStream, Rect, BitmapFactory.Options) will fill in the density associated with the resource.
zh_cn: 如果这是 0，那么 decodeResource(Resources，int) ，decodeResource(Resources, int, android.graphics.BitmapFactory.Options) 和 decodeResourceStream(Resources, TypedValue, InputStream, Rect, BitmapFactory.Options) 将填充与资源相关联的密度。

source: If this is false, then the bitmap will explicitly make a copy of the input data, and keep that.
zh_cn: 如果这是 false，那么位图将显式地复制输入数据，并保留它。

source: If this is non-null, the decoder will try to decode into this internal configuration.
zh_cn: 如果这是非空的，则解码器将尝试解码为该内部配置。

source: If this is null, the the colors are distributed evenly along the gradient line.
zh_cn: 如果它为空，则颜色沿梯度线均匀分布。

source: If this is set to true and the image is encoded in a format with only one channel, treat that channel as alpha.
zh_cn: 如果将此设置为 true 并且图像以仅包含一个通道的格式进行编码，请将该通道视为 alpha。

source: If this is true, then the bitmap may keep a shallow reference to the input.
zh_cn: 如果这是 true，那么位图可以保持对输入的浅参考。

source: If this layout needs to support shadows on pre-L devices, use TransformationChildCard instead.
zh_cn: 如果此布局需要支持 pre-L 设备上的阴影，请改用 TransformationChildCard。

source: If this method is overridden, it is the subclass's responsibility to make sure the measured height and width are at least the view's minimum height and width (getSuggestedMinimumHeight() and getSuggestedMinimumWidth()).
zh_cn: 如果重写了这个方法，子类要确保测量出的宽高，最小要为 view 的最小宽高(getSuggestedMinimumHeight() and getSuggestedMinimumWidth()).

source: If this method is used to detect click actions, it is recommended that the actions be performed by implementing and calling #performClick().
zh_cn: 如果使用此方法检测点击操作，建议通过实现并调用 #performClick() 来执行操作。

source: If this method is used to detect click actions, it is recommended that the actions be performed by implementing and calling performClick().
zh_cn: 如果使用此方法检测点击操作，建议通过实现并调用 performClick() 来执行操作。

source: If this method returns false, RecyclerView will check the View's transient state again before giving a final decision.
zh_cn: 如果此方法返回 false，则 RecyclerView 将在给出最终决定之前再次检查 View 的瞬态。

source: If this returns true, the bitmap can be reconstructed by passing a corresponding inputstream to BitmapFactory.decodeStream().
zh_cn: 如果这返回 true，则可以通过将相应的输入流传递给 BitmapFactory.decodeStream() 来重建位图。

source: If true (which is the default), the resulting bitmap will have its color channels pre-multipled by the alpha channel.
zh_cn: 如果为 true(这是默认值)，则生成的位图的颜色通道将由 Alpha 通道预先倍增。

source: If true, changes will affect ViewHolder's pre-layout position, if false, they'll be applied before the second layout pass
zh_cn: 如果为 true，则更改将影响 ViewHolder 的预布局位置，如果为 false，则在第二个布局过程之前应用这些更改

source: If true, it will be the height of the input image without any accounting for scaling.
zh_cn: 如果为 true，那么将是输入图像的高度，而不考虑缩放比例。

source: If true, it will be the width of the input image without any accounting for scaling.
zh_cn: 如果为 true，那将是输入图像的宽度，而不考虑缩放比例。

source: If true, the image view will be baseline aligned with based on its bottom edge.
zh_cn: 如果为 true，则图像 view 将基于其底边基线对齐。

source: If true, the image will be cropped to fit within its padding.
zh_cn: 如果为 true，则将裁剪图像以适合其 padding。

source: If value is not a valid number, 80 is substituted.
zh_cn: 如果值不是有效的数字，将会使用 80 代替。

source: If value is not a valid number, die.
zh_cn: 如果值不是有效的数字，结束。

source: If you absolutely need it, define a close() method (or the like) and document exactly when that method needs to be called (see InputStream for an example).
zh_cn: 如果你的确需要终结器，请定义一个 close() 方法（或类似方法），并注明需要调用该方法的确切时间（有关示例，请参阅 InputStream）。

source: If you add opposing constraints on a view, the constraint lines become squiggly like a spring to indicate the opposing forces, as shown in video 2.
zh_cn: 如果在 view 上添加了相反的约束，约束线会变成像弹簧一样扭曲来表示相反的力，就像视频 2。

source: If you are converting more than one image, click Next to advance to the next image.
zh_cn: 如果要转换多个图像，请单击 Next 以前进到下一图像。

source: If you are converting more than one image, the conversion is a single step, and can be undone to revert all the images you converted at once.
zh_cn: 如果要转换多个图像，转换只需一步，即可撤消以立即还原所有转换的图像。

source: If you are going to use it this way, you need to be aware of some threading semantics:
zh_cn: 如果你打算以这种方式使用它，你需要了解一些线程语义：

source: If you are implementing XML layout attributes as shown in the example, this is the corresponding definition for them that would go in res/values/attrs.xml:
zh_cn: 如果你正在实现示例中所示的 XML 布局属性，那么它们将在 res/values/attrs.xml 中进行相应的定义：

source: If you are not doing this, you may need to adjust some Gallery properties, such as the spacing.
zh_cn: 如果你不这样做，则可能需要调整一些 Gallery 属性，例如间距。

source: If you are not overriding getSpanIndex(int, int), you should set this to true for better performance.
zh_cn: 如果你正重写 getSpanIndex(int, int)，你应该设置该值为 true 以获得更好的性能。

source: If you are not satisfied with the default button style, you can customize it.
zh_cn: 如果你对默认按钮样式不满意，可以自定义它。

source: If you are using ActionBar in overlay mode with Window.FEATURE_ACTION_BAR_OVERLAY, this flag will also impact the insets it adds to those given to the application.
zh_cn: 如果在 overlay 模式下使用 ActionBar 并使用 Window.FEATURE_ACTION_BAR_OVERLAY，则此标志还会影响它添加到给定应用程序的中的 insets。

source: If you are writing an adapter it will always be more efficient to use the more specific change events if you can.
zh_cn: 如果你正在编写适配器，那么如果可以的话，使用更具体的更改事件总是更有效的。

source: If you do so, you'll usually want to wrap this ChipGroup in a HorizontalScrollView.
zh_cn: 如果这样做，通常需要将此 ChipGroup 包装在 HorizontalScrollView 中。

source: If you don't include resources for a specific screen density, Android automatically scales existing resources originally designed for other screen densities.
zh_cn: 如果你不包含特定屏幕密度的资源，Android 会自动扩展最初为其他屏幕密度设计的现有资源。

source: If you don't specify a column number for a child cell, it will autoincrement to the next available column.
zh_cn: 如果没有为子单元格指定列号，它将自动增加到下一个可用列。

source: If you don't want to create a completely customized component, but instead are looking to put together a reusable component that consists of a group of existing controls, then creating a Compound Component (or Compound Control) might fit the bill.
zh_cn: 如果你不想创建完全自定义的组件，而是想创建一个由一组已存在的控件组成的可复用的组件，那么创建一个组合组件(或组合控件)可以满足你的需求。

source: If you don't yet have enough information to initialize a variable sensibly, postpone the declaration until you do.
zh_cn: 如果你还没有足够的信息来合理地初始化某个变量，请推迟到信息充足时再进行声明。

source: If you fail to call this method from an overridden onMeasure() method, the result will be an exception at measurement time.
zh_cn: 如果你在重写 onMeasure() 方法时没有成功调用该方法，在测量时这个结果将会出错。

source: If you have a complex UI, consider writing a custom ViewGroup to perform its layout.
zh_cn: 如果你有复杂的 UI，请考虑编写自定义 ViewGroup 来执行其布局。

source: If you have a faster way to calculate span index for your items, you should override this method.
zh_cn: 如果你有更快的方法来计算 item 的 span index，则重写该方法。

source: If you have already depended on this class, consider copying the implementation from AOSP into your project or re-implementing a similar widget by yourselves
zh_cn: 如果你已经依赖此类，请考虑将实现从 AOSP 复制到你的项目中或者自己重新实现类似的小部件

source: If you haven't done so already, import the NotePad sample into Android Studio (or just look at the source using the link provided).
zh_cn: 如果你还没看过这个 demo，可以导入 Android Studio (或者用提供的链接看下源代码。)。

source: If you instead want the view to stretch its size to meet the constraints, switch the size to "match constraints".
zh_cn: 如果你想拉伸 view 的尺寸以满足约束， switch the size to "match constraints"。

source: If you instead want the view to stretch its size to meet the constraints, switch the size to "match constraints"; or if you want to keep the current size but move the view so that it is not centered, adjust the constraint bias.
zh_cn: 如果你想拉伸 view 的尺寸以满足约束， switch the size to "match constraints"；或者如果你想保留当前的大小，但想移动 view 使其不居中，adjust the constraint bias。

source: If you know that only a small percentage of your users have devices with specific densities, consider whether you need to bundle those densities into your app.
zh_cn: 如果你知道只有一小部分用户拥有具有特定密度的设备，请考虑是否需要将这些密度捆绑到你的应用中。

source: If you learn that your display times are slower than you’d like, you can go on to try to identify the bottlenecks in the startup process.
zh_cn: 如果你了解到显示时间比你想要的慢，你可以继续尝试识别启动过程中的瓶颈。

source: If you need finer control over your view's layout parameters, implement onMeasure().
zh_cn: 如果需要更好地控制 view 的布局参数，请实现 onMeasure()。

source: If you need the position of an item later on (e.g. in a click listener), use ViewHolder#getAdapterPosition() which will have the updated adapter position.
zh_cn: 如果以后需要某个项的位置(例如在点击监听器中)，请使用 ViewHolder#getAdapterPosition() 方法，它具有更新的适配器位置。

source: If you need to access Adapter for additional data, you can call getChildAdapterPosition(View) to get the adapter position of the View.
zh_cn: 如果你需要访问 Adapter 以获取更多的数据，你可以调用 getChildAdapterPosition(View) 来获得该 view 的 adapter 位置。

source: If you need to access a MaterialCardView directly, set an android:id and use findViewById(int).
zh_cn: 如果需要直接访问 MaterialCardView，请设置 android:id 并使用 findViewById(int)。

source: If you need to access a View directly, set an android:id and use findViewById(int).
zh_cn: 如果你需要直接访问 View，请设置 android:id 并使用 findViewById(int)。

source: If you omit this call, the View class throws a runtime exception.
zh_cn: 如果省略此调用，View 类将引发运行时异常。

source: If you only need to make small adjustments to an existing widget or layout, you can simply subclass the widget or layout and override its methods.
zh_cn: 如果你只需要对现有的 widget 或 layout 作小的调整，你可以简单地创建它们的子类并重写相关方法。

source: If you only want to process a few gestures, you can extend GestureDetector.SimpleOnGestureListener instead of implementing the GestureDetector.OnGestureListener interface.
zh_cn: 如果你只想处理几个手势，可以继承 GestureDetector.SimpleOnGestureListener，而不是实现 GestureDetector.OnGestureListener 界面。

source: If you override this method, you need to make sure it is consistent with getSpanSize(int).
zh_cn: 如果你重写该方法，你需要确保它与 getSpanSize(int) 一致。

source: If you press the button and select something from the list, it populates the EditText field, but the user can also type something directly into the EditText if they prefer.
zh_cn: 如果你按下按钮并从列表中选择了某项，它会填充 EditText，但是如果用户想要，也可以直接在 EditText 中输入。
